Revit 2027 API
CommandMenuItem Methods
The CommandMenuItem type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from MenuItem)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetAvailabilityClassName |  Set availabilityClassName of CommandMenuItem
SetToolTip |  Set toolTip of CommandMenuItem
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
CommandMenuItem Class
Autodesk.Revit.UI Namespace